app/controllers/bets_controller.rb

  def index
    @bets = Bet.all
---
SELECT "bets".* FROM "bets"

  def create
    @game = Game.find(params[:game_id])
    @bet = @game.bets.new(bet_params)
    @bet.user = current_user

    respond_to do |format|
      if @bet.save
---
SELECT  "games".* FROM "games" WHERE "games"."id" = $1 LIMIT 1  [["id", 1]]
INSERT INTO "bets" ("s1", "s2", "game_id", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["s1", 1], ["s2", 2], ["game_id", 1], ["user_id", 1], ["created_at", "2015-05-12 09:16:19.804485"], ["updated_at", "2015-05-12 09:16:19.804485"]]

  def destroy
    @bet.destroy
---
DELETE FROM "bets" WHERE "bets"."id" = $1  [["id", 1]]

    def set_bet
      @bet = Bet.find(params[:id])
---
SELECT  "bets".* FROM "bets" WHERE "bets"."id" = $1 LIMIT 1  [["id", 1]]