app/controllers/games_controller.rb

SELECT "games".* FROM "games"
---
  def index
    @games = Game.paginate(:page => params[:page], :per_page => 5)

INSERT INTO "games" ("id", "description", "pool", "e1", "e2", "s1", "s2", "location", "start", "end", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12) RETURNING "id"
---
  def create
    @game = Game.new(game_params)

    respond_to do |format|
      if @game.save

DELETE FROM "games" WHERE "games"."id" = $1  [["id", 1]]
---
  def destroy
    @game.destroy